# Уставшие от необычно теплой зимы, жители решили узнать,
# действительно ли это самая длинная оттепель за всю историю
# наблюдений за погодой. Они обратились к синоптикам, а те, в
# свою очередь, занялись исследованиями статистики за
# прошлые годы. Их интересует, сколько дней длилась самая
# длинная оттепель. Оттепелью они называют период, в
# который среднесуточная температура ежедневно превышала
# 0 градусов Цельсия. Напишите программу, помогающую
# синоптикам в работе.
# Пользователь вводит число N – общее количество рассматриваемых
# дней (1 ≤ N ≤ 100). В следующих строках располагается N целых чисел.
# Каждое число – среднесуточная температура в соответствующий день.
# Температуры – целые числа и лежат в диапазоне от –50 до 50
n = int(input("Введите количество рассматриваемых дней: "))
max = result = 0
for i in range(n):
    temp = int(input("Введите температуру: "))
    if temp > 0:
        max += 1
    else:
        if max > result:
            result, max = max, 0
        max = 0
if result == 0:
    print(f"Самая длинная оттепель длилась {max} дней")
else:
    print(f"Самая длинная оттепель длилась {result} дней")
